app/controllers/appearances_controller.rb

  def new
    @guests = Guest.all
    @episodes = Episode.all
---
SELECT "guests".* FROM "guests"
SELECT "episodes".* FROM "episodes"

  def create
    @appearance = Appearance.create(appearance_params)
    if @appearance.valid?
      redirect_to episode_path(Episode.find(@appearance.episode_id))
---
INSERT INTO "appearances" ("guest_id", "episode_id", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["guest_id", 8], ["episode_id", 13], ["rating", 3], ["created_at", "2020-07-01 15:29:02.566621"], ["updated_at", "2020-07-01 15:29:02.566621"]]
SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]